type QuoteType = {
  [type: string]: {
    name: string;
    quote: string;
  };
};

export const QUOTE: QuoteType = {
  carrot: {
    name: '근육맨 당근',
    quote:
      '튼튼한 제 알통이 보이시나요? 사람들은 제 팔다리가 곧게 뻗지 않았다는 이유로 못난이 당근이라며 먹지 않아요.사람들은 은은한 단맛과 아삭한 식감, 비타민 가득한 제 매력을 몰라주지만, 저는 각양각색 개성만점인 못난이 당근 친구들이 자랑스러워요!',
  },
  potato: {
    name: '코훌쩍 아기감자',
    quote:
      '사람들은 크기가 제 작고 볼록한 팔다리를 보고 못난이 감자라며 먹지않아요. 크기가 작다는 이유로 맛이 없다고 생각하신다면 슬퍼져요. 사람들은 제주의 해풍을 맞아 단맛이 감도는 저의 진가를 몰라주지만, 감자 친구들이 자랑스러워요!',
  },
  pumpkin: {
    name: '스윗한 밤호박',
    quote:
      '포슬포슬 달달한 밤맛이 나는 미니 밤호박이예요. 넘어져 생긴 상처가 아문 흔적을 보며 사람들은 못난이 밤호박이라며 저를 먹지 않아요. 하지만 저는 한 손에 잡힐 정도로 작아 손질도 쉽고, 달고 맛있답니다. 청정 제주에서 자란 저와 밤호박 친구들에게 관심 가져주세요!',
  },
  tangerine: {
    name: '화가난 한라봉',
    quote:
      '사람들은 저의 우락부락한 모습과 점을 보고 무서운 못난이 한라봉이라며 먹지않아요. 태풍을 농약없이 이겨내낸 저의 모습일 뿐이랍니다. 사람들은 저를 몰라주지만, 껍질 채 그대로 먹어도 되는 못난이 한라봉 친구들이 자랑스러워요!',
  },
  broccoli: {
    name: '키다리 브로콜리',
    quote:
      '사람들은 제가 머리숱이 없고, 키가 너무 크다고 못난이 브로콜리라며 먹지 않아요. 저와 친구들은 매년 버려질 위기에 처하고 있어요. 맛과 식감은 아무 문제없는 저의 진가를 몰라주어 슬프답니다. 늘씬하고 길쭉한 개성만점 친구들에 관심가져주세요!',
  },
  cabbage: {
    name: '멋쟁이 고깔오빠',
    quote:
      '왜 제가 둥글지 않냐구요? 저는 일반 양배추의 사촌 품종이랍니다. 저는 일반 양배추와 식감도 맛도 달라요. 잎 두께가 훨씬 얇아 부드럽고 연한 식감을 갖고 있어요! 쑥쑥 자라다가 몸통이 살짝 터진 것 뿐이랍니다. 사람들은 뾰족한 제 모습이 못나다고 하지만 저만의 멋과 개성이 자랑스러워요!',
  },
};
